
const Map subjectsMap = {
  "شعبة علوم تجريبية": {
    "علوم الطبيعة والحياة": 6,
    "العلوم الفيزيائية": 5,
    "الرياضيات": 5,
    "اللغة العربية وآدابها": 3,
    "العلوم الإسلامية": 2,
    "التاريخ والجغرافيا": 2,
    "الفلسفة": 2,
    "اللغة الفرنسية": 2,
    "اللغة الإنجليزية": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  },
  "شعبة آداب وفلسفة": {
    "اللغة العربية وآدابها": 6,
    "الفلسفة": 6,
    "التاريخ والجغرافيا": 4,
    "اللغة الفرنسية": 3,
    "اللغة الإنجليزية": 3,
    "العلوم الإسلامية": 2,
    "الرياضيات": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  },
  "شعبة لغات أجنبية": {
    "اللغة العربية وآدابها": 5,
    "اللغة الفرنسية": 5,
    "اللغة الإنجليزية": 5,
    "اللغة الإسبانية": 4,
    "اللغة الألمانية": 4,
    "اللغة الإيطالية": 4,
    "العلوم الإسلامية": 2,
    "الرياضيات": 2,
    "التاريخ و الجغرافيا": 3,
    "الفلسفة": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  },
  "شعبة تسيير واقتصاد": {
    "التسيير المالي والمحاسبي": 6,
    "الاقتصاد والمناجمنت": 5,
    "الرياضيات": 5,
    "التاريخ والجغرافيا": 4,
    "اللغة العربية وآدابها": 3,
    "القانون": 2,
    "العلوم الإسلامية": 2,
    "الفلسفة": 2,
    "اللغة الفرنسية": 2,
    "اللغة الإنجليزية": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  },
  "شعبة رياضيات": {
    "الرياضيات": 7,
    "العلوم الفيزيائية": 6,
    "اللغة العربية وآدابها": 3,
    "علوم الطبيعة والحياة": 2,
    "العلوم الإسلامية": 2,
    "التاريخ والجغرافيا": 2,
    "الفلسفة": 2,
    "اللغة الفرنسية": 2,
    "اللغة الإنجليزية": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  },
  "شعبة تقني رياضي": {
    "الهندسة الميكانيكية": 7,
    "الهندسة الكهربائية": 7,
    "الهندسة المدنية": 7,
    "هندسة الطرائق": 7,
    "العلوم الفيزيائية": 6,
    "الرياضيات": 6,
    "اللغة العربية وآدابها": 2,
    "العلوم الإسلامية": 2,
    "التاريخ والجغرافيا": 2,
    "الفلسفة": 2,
    "اللغة الفرنسية": 2,
    "اللغة الإنجليزية": 2,
    "اللغة الأمازيغية": 2,
    "التربية البدنية": 1
  }
};

const Map fieldDict = {
  "شعبة علوم تجريبية": "sciences",
  "شعبة لغات أجنبية": "langues",
  "شعبة آداب وفلسفة": "lit",
  "شعبة تسيير واقتصاد": "gestion",
  "شعبة رياضيات": "maths",
  "شعبة تقني رياضي": "tech"
};

const Map subjectDict = {
  "علوم الطبيعة والحياة": "sci",
  "التاريخ والجغرافيا": "hisgeo",
  "الفلسفة": "philo",
  "اللغة الفرنسية": "french",
  "اللغة الإنجليزية": "english",
  "العلوم الإسلامية": "islam",
  "الرياضيات": "math",
  "اللغة العربية وآدابها": "arabic",
  "العلوم الفيزيائية": "physics",
  "اللغة الألمانية": "german",
  "اللغة الإسبانية": "spanish",
  "اللغة الإيطالية": "italian",
  "القانون": "law",
  "التسيير المالي والمحاسبي": "accounting",
  "الاقتصاد والمناجمنت": "economy",
  "الهندسة الميكانيكية": "genie_mecanique",
  "الهندسة الكهربائية": "genie_electrique",
  "الهندسة المدنية": "genie_civil",
  "هندسة الطرائق": "genie_procedes",
  "اللغة الأمازيغية": "tamazight"
};
